БухЭксп/Documents/CW_КорректировкаОперативнойЗадолженности.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>CW_КорректировкаОперативнойЗадолженности</Name>
			<BasedOn>
				<xr:Item>Document.CW_КорректировкаАктированияСчетов</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccountingRegister.CW_МСФО</xr:Item>
				<xr:Item>AccumulationRegister.CW_ОперативнаяКредиторскаяЗадолженность</xr:Item>
				<xr:Item>AccumulationRegister.CW_ОперативнаяДебиторскаяЗадолженность</xr:Item>
				<xr:Item>AccumulationRegister.CW_ОплатаИсходящихСчетов</xr:Item>
				<xr:Item>InformationRegister.CW_ОплатаВходящихДокументов</xr:Item>
				<xr:Item>InformationRegister.CW_ОплатаИсходящихДокументов</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_Организации</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_Контрагенты</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ДоговорыПоГрузоперевозкам</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Курс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЗадолженности</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CW_ВидыОперативнойЗадолженности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CW_ВидыОперацийКорректировкиОперативнойЗадолженности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтрагентКредитор</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_Контрагенты</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорКредитор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ДоговорыПоГрузоперевозкам</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РучнаяКорректировка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетСписания</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.CW_МСФО</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Субконто1</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.CW_ВидыСубконтоМСФО</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Субконто2</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.CW_ВидыСубконтоМСФО</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Субконто3</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.CW_ВидыСубконтоМСФО</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПриложениеКДоговору</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ПриложенияКДоговорам</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПриложениеКДоговоруКредитор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ПриложенияКДоговорам</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СписаниеОперативнойЗадолженности</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДокументСчет</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.CW_КорректировкаОперативнойЗадолженности</v8:Type>
								<v8:Type>cfg:DocumentRef.CW_ДвижениеДенежныхСредств</v8:Type>
								<v8:Type>cfg:DocumentRef.CW_ДоходыПоГрузоперевозке</v8:Type>
								<v8:Type>cfg:DocumentRef.CW_РасходыПоГрузоперевозке</v8:Type>
								<v8:Type>cfg:DocumentRef.CW_Оплата</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокументАкт</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.CW_ДоходыПоГрузоперевозке</v8:Type>
								<v8:Type>cfg:DocumentRef.CW_РасходыПоГрузоперевозке</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетЗадолженности</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.CW_Счет</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Валюта</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.CW_Валюты</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Курс</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Кратность</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаВал</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДебиторскаяЗадолженность</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидЗадолженности</Name>
							<Type>
								<v8:Type>cfg:EnumRef.CW_ВидыОперативнойЗадолженности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокументСчет</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.CW_КорректировкаОперативнойЗадолженности</v8:Type>
								<v8:Type>cfg:DocumentRef.CW_ДвижениеДенежныхСредств</v8:Type>
								<v8:Type>cfg:DocumentRef.CW_ДоходыПоГрузоперевозке</v8:Type>
								<v8:Type>cfg:DocumentRef.CW_РасходыПоГрузоперевозке</v8:Type>
								<v8:Type>cfg:DocumentRef.CW_Оплата</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетЗадолженности</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.CW_Счет</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Валюта</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.CW_Валюты</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Курс</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Кратность</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаВал</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>КредиторскаяЗадолженность</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидЗадолженности</Name>
							<Type>
								<v8:Type>cfg:EnumRef.CW_ВидыОперативнойЗадолженности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокументСчет</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.CW_КорректировкаОперативнойЗадолженности</v8:Type>
								<v8:Type>cfg:DocumentRef.CW_ДвижениеДенежныхСредств</v8:Type>
								<v8:Type>cfg:DocumentRef.CW_ДоходыПоГрузоперевозке</v8:Type>
								<v8:Type>cfg:DocumentRef.CW_РасходыПоГрузоперевозке</v8:Type>
								<v8:Type>cfg:DocumentRef.CW_Оплата</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетЗадолженности</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.CW_Счет</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Валюта</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.CW_Валюты</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Курс</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Кратность</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаВал</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

БухЭксп/AccumulationRegisters/CW_ОперативнаяДебиторскаяЗадолженность.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>CW_ОперативнаяДебиторскаяЗадолженность</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Всего_Валюта</Name>
					<Comment>"Всего" в валюте договора</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Всего</Name>
					<Comment>"Всего" в базовой валюте учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CW_ВидыДвиженийПоОперативнойЗадолженности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_Организации</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_Контрагенты</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ДоговорыПоГрузоперевозкам</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПриложениеКДоговору</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ПриложенияКДоговорам</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Счет</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.CW_КорректировкаОперативнойЗадолженности</v8:Type>
						<v8:Type>cfg:DocumentRef.CW_ДвижениеДенежныхСредств</v8:Type>
						<v8:Type>cfg:DocumentRef.CW_ДоходыПоГрузоперевозке</v8:Type>
						<v8:Type>cfg:DocumentRef.CW_Оплата</v8:Type>
						<v8:Type>cfg:DocumentRef.CW_РеализацияПрочихТоваровУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_Валюты</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетУчета</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_Счет</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

БухЭксп/Enums/CW_ВидыОперативнойЗадолженности.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>CW_ВидыОперативнойЗадолженности</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Кредиторская</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Дебиторская</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

БухЭксп/Documents/CW_КорректировкаОперативнойЗадолженности/Forms/ФормаЗачетЗадолженности/Ext/Form/Module.bsl
//События формы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	

	CW_Документы.УстановитьПараметрыФункциональныхОпцийФормы(Этаформа);
	
	_УФС.ОтключитьИсториюВыбораЭлементовФормы(ЭтаФорма);
	
	ОпределитьПараваДоступа();
	
	ВалютаРегламентированногоУчета = CW_Настройки.ВалютаРегламентированногоУчета();
	
	Если Параметры.Ключ.Пустая() Тогда
		ОсновнаяОрганизация = CW_Настройки.ОсновнаяОрганизация();
		Объект.Организация  = ОсновнаяОрганизация;	
	КонецЕсли;
	
	СформироватьЗаголовокДокумента();

	СостояниеДокумента = ОбщегоНазначенияБП.СостояниеДокумента(Объект); // ВызовБП
	
	УстановитьДоступныеТипыДокументаОснования("КредиторскаяЗадолженностьДокументСчет", "ДоговорКредитор");
 	УстановитьДоступныеТипыДокументаОснования("ДебиторскаяЗадолженностьДокументСчет", "Договор");

	ВидимостьВалютныхПоказателей();
	
	УправлениеЭлементамиФормы();
	ОбновитьИтогиНаФорме();

	//Подсистема.УчетПриложенийДоговоров
	УстановитьВидимостьПриложенийДоговоров();
	//Подсистема.УчетПриложенийДоговоров
	
	//Внешние подклчюаемые команды
	CW_ПодключаемыеКомандыСервер.ПриСозданииНаСервере(ЭтотОбъект);
	
КонецПроцедуры   

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ЗаполнитьДобавленныеКолонкиТабличныхЧастей(ТекущийОбъект, "ДебиторскаяЗадолженность");
	ЗаполнитьДобавленныеКолонкиТабличныхЧастей(ТекущийОбъект, "КредиторскаяЗадолженность");
	
	
КонецПроцедуры  

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ВалютаЗачетаДЗ 	= Объект.Договор.ВалютаДоговора;
	ВалютаЗачетаКЗ 	= Объект.ДоговорКредитор.ВалютаДоговора;   
	
	ИмяПоляКЗ 		= "СуммаВал";
	Если Объект.ДоговорКредитор.ВалютаДоговора = ВалютаРегламентированногоУчета 
		или Объект.ДоговорКредитор.ВзаиморасчетыВУЕ Тогда
		ИмяПоляКЗ 		= "Сумма";
		ВалютаЗачетаКЗ 	= ВалютаРегламентированногоУчета;
	КонецЕсли;  
	
	ИмяПоляДЗ = "СуммаВал";
	Если Объект.Договор.ВалютаДоговора = ВалютаРегламентированногоУчета 
		или Объект.Договор.ВзаиморасчетыВУЕ Тогда
		ИмяПоляДЗ 		= "Сумма";
		ВалютаЗачетаДЗ	= ВалютаРегламентированногоУчета
	КонецЕсли;  
	
	ЗачтеноКЗ = Объект.КредиторскаяЗадолженность.Итог(ИмяПоляКЗ);  
	ЗачтеноДЗ = Объект.ДебиторскаяЗадолженность.Итог(ИмяПоляДЗ);   
	
КонецПроцедуры


&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	СформироватьЗаголовокДокумента();  
	
	ЗаполнитьДобавленныеКолонкиТабличныхЧастей(ТекущийОбъект, "ДебиторскаяЗадолженность");
	ЗаполнитьДобавленныеКолонкиТабличныхЧастей(ТекущийОбъект, "КредиторскаяЗадолженность");

	СостояниеДокумента = ОбщегоНазначенияБП.СостояниеДокумента(Объект); // ВызовБП
	
КонецПроцедуры  

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
		
	//Подсистема.РаботаСПодключаемымиОбъектами
	CW_ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, ПараметрыЗаписи);
	//Подсистема.РаботаСПодключаемымиОбъектами

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
КонецПроцедуры 

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ВыполнитьМетодВладельца" Тогда
			
		Если ТипЗнч(Параметр) = тип("Структура") Тогда
			УникальныйИдентификаторВладельца 	= Неопределено;
			МетодыФормыВладельца 				= Неопределено;
			
			Параметр.Свойство("УникальныйИдентификатор"	, УникальныйИдентификаторВладельца);
			Параметр.Свойство("МетодыФормыВладельца"	, МетодыФормыВладельца);
			
			Если ЭтаФорма.УникальныйИдентификатор = УникальныйИдентификаторВладельца Тогда
				Если Не МетодыФормыВладельца = Неопределено и ТипЗнч(МетодыФормыВладельца) = Тип("Массив") Тогда
					
					Для Каждого СтрокаМассива из МетодыФормыВладельца Цикл
						Попытка
							Выполнить(СтрокаМассива);
						Исключение
						КонецПопытки;
					КонецЦикла;
					
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;	

	КонецЕсли;
	
КонецПроцедуры
//---События формы

//События реквизитов формы   
&НаКлиенте
Процедура НомерПриИзменении(Элемент)
	
	СформироватьЗаголовокДокумента();
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	СформироватьЗаголовокДокумента();
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	ОчиститьТабличныеЧастиДокумента();
	
	Если ЗначениеЗаполнено(Объект.Номер) И ЗначениеЗаполнено(Объект.Организация) Тогда
		
		ПОВ = Новый ОписаниеОповещения("ОбработкаВопросаУстановкиНовогоНомера",ЭтотОбъект); 
		ПоказатьВопрос(ПОВ,"Установить новый номер документа", РежимДиалогаВопрос.ДаНет); 
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентКредиторПриИзменении(Элемент)
	
	КонтрагентКредиторПриИзмененииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ДоговорКредиторПриИзменении(Элемент)
	
	ОчиститьТабличныеЧастиДокумента();
	
	//Подсистема.УчетПриложенийДоговоров
	ДоговорКредиторПриИзмененииНаСервере();
	//Подсистема.УчетПриложенийДоговоров
	
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	
	КонтрагентПриИзмененииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ДоговорПриИзменении(Элемент)
	
	ДоговорПриИзмененииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура КомментарийПриИзменении(Элемент)
	
	УправлениеЭлементамиФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ДебиторскаяЗадолженностьПриИзменении(Элемент)
	
	ОбновитьИтогиНаФорме();
	
КонецПроцедуры

&НаКлиенте
Процедура КредиторскаяЗадолженностьПриИзменении(Элемент)
	
	ОбновитьИтогиНаФорме();
	
КонецПроцедуры
  
&НаКлиенте
Процедура КредиторскаяЗадолженностьДокументСчетПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.КредиторскаяЗадолженность.ТекущаяСтрока;
	КредиторскаяЗадолженностьДокументСчетПриИзмененииНаСервере(ТекущаяСтрока);
	
КонецПроцедуры

&НаКлиенте
Процедура ДебиторскаяЗадолженностьДокументСчетПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.ДебиторскаяЗадолженность.ТекущаяСтрока;
	ДебиторскаяЗадолженностьДокументСчетПриИзмененииНаСервере(ТекущаяСтрока);
	
КонецПроцедуры  

&НаСервере
Процедура КредиторскаяЗадолженностьДокументСчетПриИзмененииНаСервере(ТекущаяСтрока)
	
	СтрокаТекущая = Объект.КредиторскаяЗадолженность.НайтиПоИдентификатору(ТекущаяСтрока); 
	
	Если Объект.ДоговорКредитор.ВалютаДоговора = ВалютаРегламентированногоУчета Тогда
		СтрокаТекущая.Валюта	= ВалютаРегламентированногоУчета;
		СтрокаТекущая.Курс 		= 1;
		СтрокаТекущая.Кратность = 1;                         
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ДебиторскаяЗадолженностьДокументСчетПриИзмененииНаСервере(ТекущаяСтрока)
	
	СтрокаТекущая = Объект.ДебиторскаяЗадолженность.НайтиПоИдентификатору(ТекущаяСтрока); 

	Если Объект.Договор.ВалютаДоговора = ВалютаРегламентированногоУчета Тогда
		СтрокаТекущая.Валюта	= ВалютаРегламентированногоУчета;
		СтрокаТекущая.Курс 		= 1;
		СтрокаТекущая.Кратность = 1;                         
	КонецЕсли;
	
КонецПроцедуры 

&НаКлиенте
Процедура ДебиторскаяЗадолженностьСуммаПриИзменении(Элемент)   
	
	ТекущаяСтрока = Элементы.ДебиторскаяЗадолженность.ТекущаяСтрока;
	ПересчитатьСуммуВалПоКурсуНаСервере(ТекущаяСтрока, "ДебиторскаяЗадолженность"); 
	
КонецПроцедуры

&НаКлиенте
Процедура ДебиторскаяЗадолженностьСуммаВалПриИзменении(Элемент) 

	ТекущаяСтрока = Элементы.ДебиторскаяЗадолженность.ТекущаяСтрока;
	ПересчитатьСуммуПоКурсуНаСервере(ТекущаяСтрока, "ДебиторскаяЗадолженность"); 
	
КонецПроцедуры

&НаКлиенте
Процедура КредиторскаяЗадолженностьСуммаВалПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.КредиторскаяЗадолженность.ТекущаяСтрока;
	ПересчитатьСуммуПоКурсуНаСервере(ТекущаяСтрока, "КредиторскаяЗадолженность"); 

КонецПроцедуры

&НаКлиенте
Процедура КредиторскаяЗадолженностьСуммаПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.КредиторскаяЗадолженность.ТекущаяСтрока;
	ПересчитатьСуммуВалПоКурсуНаСервере(ТекущаяСтрока, "КредиторскаяЗадолженность"); 
	
КонецПроцедуры

&НаКлиенте
Процедура КредиторскаяЗадолженностьВалютаПриИзменении(Элемент) 
	
	ТекущаяСтрока = Элементы.КредиторскаяЗадолженность.ТекущаяСтрока;
	ОбработатьИзменениеВалюты("КредиторскаяЗадолженность", ТекущаяСтрока);
	
КонецПроцедуры  

&НаКлиенте
Процедура КредиторскаяЗадолженностьПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока Тогда
		ТекущаяСтрока = Элементы.КредиторскаяЗадолженность.ТекущаяСтрока;
		КредиторскаяЗадолженностьПриНачалеРедактированияНаСервере(ТекущаяСтрока);
	КонецЕсли;
	
КонецПроцедуры 

&НаСервере
Процедура КредиторскаяЗадолженностьПриНачалеРедактированияНаСервере(ТекущаяСтрока)
	
	СтрокаТекущая = Объект.КредиторскаяЗадолженность.НайтиПоИдентификатору(ТекущаяСтрока);
	СтрокаТекущая.Валюта = Объект.ДоговорКредитор.ВалютаДоговора;

	ОбработатьИзменениеВалюты("КредиторскаяЗадолженность", ТекущаяСтрока);
	
КонецПроцедуры


&НаКлиенте
Процедура ДебиторскаяЗадолженностьВалютаПриИзменении(Элемент)

	ТекущаяСтрока = Элементы.ДебиторскаяЗадолженность.ТекущаяСтрока;
	ОбработатьИзменениеВалюты("ДебиторскаяЗадолженность", ТекущаяСтрока);
	
КонецПроцедуры      


&НаКлиенте
Процедура ДебиторскаяЗадолженностьПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока Тогда
		ТекущаяСтрока = Элементы.ДебиторскаяЗадолженность.ТекущаяСтрока;
		ДебиторскаяЗадолженностьПриНачалеРедактированияНаСервере(ТекущаяСтрока);
	КонецЕсли;

КонецПроцедуры 

&НаСервере
Процедура ДебиторскаяЗадолженностьПриНачалеРедактированияНаСервере(ТекущаяСтрока)
	
	СтрокаТекущая = Объект.ДебиторскаяЗадолженность.НайтиПоИдентификатору(ТекущаяСтрока);
	СтрокаТекущая.Валюта = Объект.Договор.ВалютаДоговора;

	ОбработатьИзменениеВалюты("ДебиторскаяЗадолженность", ТекущаяСтрока);
	
КонецПроцедуры




&НаКлиенте
Процедура КредиторскаяЗадолженностьКурсПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.КредиторскаяЗадолженность.ТекущаяСтрока;
	ПересчитатьСуммуПоКурсуНаСервере(ТекущаяСтрока, "КредиторскаяЗадолженность");   
	
КонецПроцедуры


&НаКлиенте
Процедура КредиторскаяЗадолженностьКратностьПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.КредиторскаяЗадолженность.ТекущаяСтрока;
	ПересчитатьСуммуПоКурсуНаСервере(ТекущаяСтрока, "КредиторскаяЗадолженность");   

КонецПроцедуры    

&НаКлиенте
Процедура ДебиторскаяЗадолженностьКурсПриИзменении(Элемент)  
	
	ТекущаяСтрока = Элементы.ДебиторскаяЗадолженность.ТекущаяСтрока;
	ПересчитатьСуммуПоКурсуНаСервере(ТекущаяСтрока, "ДебиторскаяЗадолженность"); 
	
КонецПроцедуры

&НаКлиенте
Процедура ДебиторскаяЗадолженностьКратностьПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.ДебиторскаяЗадолженность.ТекущаяСтрока;
	ПересчитатьСуммуПоКурсуНаСервере(ТекущаяСтрока, "ДебиторскаяЗадолженность"); 
	
КонецПроцедуры

&НаСервере
Процедура ПересчитатьСуммуПоКурсуНаСервере(ТекущаяСтрока, ИмяТаблицы)
	
	СтрокаТекущая = Объект[ИмяТаблицы].НайтиПоИдентификатору(ТекущаяСтрока);  
	
	СтрокаТекущая.Сумма =  CW_Финансы.ПересчитатьИзВалютыВВалюту(СтрокаТекущая.СуммаВал,
		СтрокаТекущая.Валюта, ВалютаРегламентированногоУчета,
		СтрокаТекущая.Курс, 1,
		СтрокаТекущая.Кратность,1);
	
КонецПроцедуры   

&НаСервере
Процедура ПересчитатьСуммуВалПоКурсуНаСервере(ТекущаяСтрока, ИмяТаблицы)  
	
	СтрокаТекущая = Объект[ИмяТаблицы].НайтиПоИдентификатору(ТекущаяСтрока);   

	СтрокаТекущая.СуммаВал =  CW_Финансы.ПересчитатьИзВалютыВВалюту(СтрокаТекущая.Сумма,
									ВалютаРегламентированногоУчета,СтрокаТекущая.Валюта, 
									1, СтрокаТекущая.Курс, 
									1, СтрокаТекущая.Кратность);
								
КонецПроцедуры





//---События реквизитов формы  

//Команды формы
&НаКлиенте
Процедура ОчиститьДебиторскуюЗадолженность(Команда)
	
	Объект.ДебиторскаяЗадолженность.Очистить();
	ОбновитьИтогиНаФорме();
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьКредиторскуюЗадолженность(Команда)
	
	Объект.КредиторскаяЗадолженность.Очистить();
	ОбновитьИтогиНаФорме();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьДебиторскуюЗадолженность(Команда)
	
	ЗаполнитьДебиторскуюЗадолженностьНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьКредиторскуюЗадолженность(Команда)
	
	ЗаполнитьКредиторскуюЗадолженностьНаСервере();
	
КонецПроцедуры
//---Команды формы


//Обработчики событий   
&НаСервере
Функция КонтрагентКредиторПриИзмененииНаСервере()

	Если НЕ ЗначениеЗаполнено(Объект.Контрагент) Тогда
		Объект.Контрагент = Объект.КонтрагентКредитор;
	КонецЕсли; 
	
	ОчиститьТабличныеЧастиДокумента();
	УправлениеЭлементамиФормы();
	
КонецФункции

&НаСервере
Функция КонтрагентПриИзмененииНаСервере()
	
	Если Не ЗначениеЗаполнено(Объект.КонтрагентКредитор) Тогда
		Объект.КонтрагентКредитор = Объект.Контрагент;
	КонецЕсли; 

	ОчиститьТабличныеЧастиДокумента();
	УправлениеЭлементамиФормы();
	
	//Подсистема.УчетПриложенийДоговоров
	CW_УчетПриложенийДоговоровСервер.ПриИзмененииКонтрагентаНаСервере(ЭтаФорма);
	//Подсистема.УчетПриложенийДоговоров

КонецФункции

&НаСервере
Процедура ДоговорКредиторПриИзмененииНаСервере()
	
	Если Не Объект.ДоговорКредитор.ИспользуютсяПриложения Тогда
		Объект.ПриложениеКДоговоруКредитор = Неопределено;
	КонецЕсли;  
	
	УстановитьДоступныеТипыДокументаОснования("КредиторскаяЗадолженностьДокументСчет", "ДоговорКредитор");
	ВидимостьВалютныхПоказателей();
	     	
	УстановитьВидимостьПриложенийДоговоров();
	ОчиститьТабличныеЧастиДокумента();
	
КонецПроцедуры

&НаСервере
Процедура ДоговорПриИзмененииНаСервере()
	
	Если Не Объект.Договор.ИспользуютсяПриложения Тогда
		Объект.ПриложениеКДоговору = Неопределено;
	КонецЕсли;
	
	УстановитьДоступныеТипыДокументаОснования("ДебиторскаяЗадолженностьДокументСчет", "Договор");
	ВидимостьВалютныхПоказателей();
	
	УстановитьВидимостьПриложенийДоговоров();
	ОчиститьТабличныеЧастиДокумента();

КонецПроцедуры
  

&НаКлиенте
Процедура ДоговорКредиторНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;   
	
	СтруктураОтбора = ПолучитьСтруктуруПараметровВыбораДоговора(Объект.КонтрагентКредитор, Объект.Договор); 
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("МножественныйВыбор", Ложь);
	СтруктураПараметров.Вставить("ЗакрыватьПриВыборе", Истина);
	СтруктураПараметров.Вставить("Отбор", СтруктураОтбора);
	
	ОткрытьФорму("Справочник.CW_ДоговорыПоГрузоперевозкам.ФормаВыбора", СтруктураПараметров, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ДоговорНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;

	СтруктураОтбора = ПолучитьСтруктуруПараметровВыбораДоговора(Объект.Контрагент, Объект.ДоговорКредитор); 
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("МножественныйВыбор", Ложь);
	СтруктураПараметров.Вставить("ЗакрыватьПриВыборе", Истина);
	СтруктураПараметров.Вставить("Отбор", СтруктураОтбора);
	
	ОткрытьФорму("Справочник.CW_ДоговорыПоГрузоперевозкам.ФормаВыбора", СтруктураПараметров, Элемент);

КонецПроцедуры


&НаСервере
Функция ПолучитьСтруктуруПараметровВыбораДоговора(ВладелецДоговора, ДоговорИсточник) 
	
	СтруктураОтбора = Новый Структура;
	СтруктураОтбора.Вставить("Организация", Объект.Организация);
	СтруктураОтбора.Вставить("Владелец", 	ВладелецДоговора);
	
	Если ЗначениеЗаполнено(ДоговорИсточник) Тогда  
		
		Если ДоговорИсточник.ВалютаДоговора = ВалютаРегламентированногоУчета Тогда  
			
			МассивДоговоров = ПолучитьМассивДоговоровДляОтбора(СтруктураОтбора, ВалютаРегламентированногоУчета);
			СтруктураОтбора.Вставить("Ссылка", 	МассивДоговоров);  
			
		ИначеЕсли ДоговорИсточник.ВалютаДоговора <> ВалютаРегламентированногоУчета 
			И ДоговорИсточник.ВзаиморасчетыВУЕ Тогда    
			
			МассивДоговоров = ПолучитьМассивДоговоровДляОтбораУЕ(СтруктураОтбора, ВалютаРегламентированногоУчета, ДоговорИсточник.ВалютаДоговора);
			СтруктураОтбора.Вставить("Ссылка", 	МассивДоговоров);  
			
		ИначеЕсли ДоговорИсточник.ВалютаДоговора <> ВалютаРегламентированногоУчета 
			И Не ДоговорИсточник.ВзаиморасчетыВУЕ Тогда
			
			СтруктураОтбора.Вставить("ВалютаДоговора", ДоговорИсточник.ВалютаДоговора); 
			
		КонецЕсли; 

	КонецЕсли;   
	
	Возврат СтруктураОтбора;
	
КонецФункции  

&НаСервереБезКонтекста
Функция ПолучитьМассивДоговоровДляОтбора(ПараметрыОтбора, ВалютаРегламентированногоУчета)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_ДоговорыПоГрузоперевозкам.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.CW_ДоговорыПоГрузоперевозкам КАК CW_ДоговорыПоГрузоперевозкам
	               |ГДЕ
	               |	CW_ДоговорыПоГрузоперевозкам.Организация = &Организация
	               |	И CW_ДоговорыПоГрузоперевозкам.Владелец = &Владелец
	               |	И CW_ДоговорыПоГрузоперевозкам.ПометкаУдаления = ЛОЖЬ
	               |	И (CW_ДоговорыПоГрузоперевозкам.ВзаиморасчетыВУЕ = ИСТИНА
	               |			ИЛИ CW_ДоговорыПоГрузоперевозкам.ВалютаДоговора = &ВалютаДоговора)";
	
	Запрос.УстановитьПараметр("Организация", 	ПараметрыОтбора.Организация);
	Запрос.УстановитьПараметр("Владелец",  		ПараметрыОтбора.Владелец);
 	Запрос.УстановитьПараметр("ВалютаДоговора", ВалютаРегламентированногоУчета);

	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Ссылка");
	
КонецФункции  

&НаСервереБезКонтекста
Функция ПолучитьМассивДоговоровДляОтбораУЕ(ПараметрыОтбора, ВалютаРегламентированногоУчета, ВалютаДоговора)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_ДоговорыПоГрузоперевозкам.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.CW_ДоговорыПоГрузоперевозкам КАК CW_ДоговорыПоГрузоперевозкам
	               |ГДЕ
	               |	CW_ДоговорыПоГрузоперевозкам.ПометкаУдаления = ЛОЖЬ
	               |	И CW_ДоговорыПоГрузоперевозкам.Организация = &Организация
	               |	И CW_ДоговорыПоГрузоперевозкам.Владелец = &Владелец
	               |	И (CW_ДоговорыПоГрузоперевозкам.ВалютаДоговора = &ВалютаРегламентированногоУчета
	               |			ИЛИ CW_ДоговорыПоГрузоперевозкам.ВалютаДоговора = &ВалютаДоговора
	               |				И CW_ДоговорыПоГрузоперевозкам.ВзаиморасчетыВУЕ = ИСТИНА)";
	
	Запрос.УстановитьПараметр("Организация", 	ПараметрыОтбора.Организация);
	Запрос.УстановитьПараметр("Владелец",  		ПараметрыОтбора.Владелец);
 	Запрос.УстановитьПараметр("ВалютаДоговора", ВалютаДоговора);
 	Запрос.УстановитьПараметр("ВалютаРегламентированногоУчета", ВалютаРегламентированногоУчета);

	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Ссылка");
	
КонецФункции

&НаСервере
Процедура ВидимостьВалютныхПоказателей()
	
	УстановитьВидимостьВалютныхПоказателей("ДебиторскаяЗадолженностьГруппаВалюта", "ДебиторскаяЗадолженностьСуммаВал", "ДебиторскаяЗадолженностьСумма", "Договор");
	УстановитьВидимостьВалютныхПоказателей("КредиторскаяЗадолженностьГруппаВалюта", "КредиторскаяЗадолженностьСуммаВал", "КредиторскаяЗадолженностьСумма", "ДоговорКредитор");

КонецПроцедуры 

&НаСервере
Процедура УстановитьВидимостьВалютныхПоказателей(ИмяЭлемента, ИмяЭлементаСуммаВал, ИмяЭлементаСуммаРуб, ИмяРеквизита)
	
	// если валюты договоров кредитора и дебитора совпадают и отличны от рублей, 
	// то показатели "Курс", "Кратность" и "Сумма (Руб.)" скрываем
	Если Объект.Договор.ВалютаДоговора = Объект.ДоговорКредитор.ВалютаДоговора
		и Объект.Договор.ВалютаДоговора <> ВалютаРегламентированногоУчета Тогда
		
		Элементы[ИмяЭлемента].Видимость = Ложь;
		Элементы[ИмяЭлементаСуммаРуб].Видимость = Ложь;
		Элементы[ИмяЭлементаСуммаВал].Видимость = Истина;
		
	// если валюты договоров кредитора и дебитора "Руб.", 
	// то показатели "Курс", "Кратность" и "Сумма (Вал.)" скрываем и оставляем только "Сумма (Руб.)"
	ИначеЕсли Объект.Договор.ВалютаДоговора = Объект.ДоговорКредитор.ВалютаДоговора
		и Объект.Договор.ВалютаДоговора = ВалютаРегламентированногоУчета Тогда
		
		Элементы[ИмяЭлемента].Видимость = Ложь;
		Элементы[ИмяЭлементаСуммаРуб].Видимость = Истина;
		Элементы[ИмяЭлементаСуммаВал].Видимость = Ложь;
		
	// если валюты различаются (этот вариант возможен когда у одного из договоров валюта "Руб")
	Иначе
		
		// показатели "Курс", "Кратность" устанавливаем в зависимости от валюты договора
		Элементы[ИмяЭлемента].Видимость = (Не Объект[ИмяРеквизита].ВалютаДоговора.Пустая() И Объект[ИмяРеквизита].ВалютаДоговора <> ВалютаРегламентированногоУчета);   
		
		// показатели "Сумма (Вал.)" и "Сумма (Руб.)" устанавливаем в зависимости от комбинации валют договоров
		
		// дебиторский договор
		Если ИмяРеквизита = "Договор" Тогда
			Если Объект.Договор.ВалютаДоговора =  ВалютаРегламентированногоУчета Тогда
				Элементы[ИмяЭлементаСуммаРуб].Видимость = Истина;
				Элементы[ИмяЭлементаСуммаВал].Видимость = Ложь;
			Иначе
				Элементы[ИмяЭлементаСуммаРуб].Видимость = Истина;
				Элементы[ИмяЭлементаСуммаВал].Видимость = Истина;
			КонецЕсли;
			
		// кредиторский договор
		ИначеЕсли ИмяРеквизита = "ДоговорКредитор" Тогда 
			Если Объект.ДоговорКредитор.ВалютаДоговора =  ВалютаРегламентированногоУчета Тогда
				Элементы[ИмяЭлементаСуммаРуб].Видимость = Истина;
				Элементы[ИмяЭлементаСуммаВал].Видимость = Ложь;
			Иначе
				Элементы[ИмяЭлементаСуммаРуб].Видимость = Истина;
				Элементы[ИмяЭлементаСуммаВал].Видимость = Истина;
			КонецЕсли;
		Иначе 
			// при корректном вызове процедуры сюда попадать не должны
		КонецЕсли;     
		
	КонецЕсли;
	
КонецПроцедуры   

&НаСервере
Процедура ОбработатьИзменениеВалюты(ИмяТабличнойЧасти, ТекущаяСтрока)
	
	СтрокаТекущая = Объект[ИмяТабличнойЧасти].НайтиПоИдентификатору(ТекущаяСтрока);  
	
	ДатаКурса  = ?(ЗначениеЗаполнено(Объект.Дата), Объект.Дата, ТекущаяДата());
	КурсВалюты = CW_Финансы.ПолучитьКурсВалюты(СтрокаТекущая.Валюта, ДатаКурса);
	
	СтрокаТекущая.Курс 		= КурсВалюты.Курс;
	СтрокаТекущая.Кратность = КурсВалюты.Кратность; 
	
	ПересчитатьСуммуПоКурсуНаСервере(ТекущаяСтрока, ИмяТабличнойЧасти); 
	
КонецПроцедуры

//---Обработчики событий 



&НаСервере
Процедура УстановитьДоступныеТипыДокументаОснования(ИмяЭлемента, ИмяРеквизита)
	
	ОграничениеТипа = ПолучитьДоступныеТипыДокументаОснования(ИмяРеквизита);
	Элементы[ИмяЭлемента].ОграничениеТипа  = Новый ОписаниеТипов(ОграничениеТипа);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьДоступныеТипыДокументаОснования(ИмяРеквизита)
	
	мТипы = Новый Массив;   

	Если Не ЗначениеЗаполнено(Объект[ИмяРеквизита]) Тогда
		Возврат мТипы;
	КонецЕсли;
	
	мТипы.Добавить(Тип("ДокументСсылка.CW_КорректировкаОперативнойЗадолженности"));
	мТипы.Добавить(Тип("ДокументСсылка.CW_ДвижениеДенежныхСредств"));
	мТипы.Добавить(Тип("ДокументСсылка.CW_Оплата"));
	
	Если Объект[ИмяРеквизита].ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СПокупателем Тогда 
		мТипы.Добавить(Тип("ДокументСсылка.CW_ДоходыПоГрузоперевозке"));                           
	Иначе
		мТипы.Добавить(Тип("ДокументСсылка.CW_РасходыПоГрузоперевозке"));                          
	КонецЕсли;
	
	Возврат мТипы; 
	
КонецФункции 



&НаСервере
Процедура ЗаполнитьДобавленныеКолонкиТабличныхЧастей(ТекущийОбъект, ИмяТаблицы)
	
	Для Каждого СтрокаТаблицы из ТекущийОбъект[ИмяТаблицы] Цикл   
		ИндексСтроки  = ТекущийОбъект[ИмяТаблицы].Индекс(СтрокаТаблицы);  

		СтрокаОбъекта = Объект[ИмяТаблицы][ИндексСтроки];
		Если ТипЗнч(СтрокаОбъекта.ДокументСчет)=Тип("ДокументСсылка.CW_КорректировкаОперативнойЗадолженности") Тогда 
			СтрокаОбъекта.Представление =  СокрЛП(СтрокаОбъекта.ДокументСчет);
		Иначе
			СтрокаОбъекта.Представление = СтрокаОбъекта.ДокументСчет.ПредставлениеДокумента;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура УправлениеЭлементамиФормы()
	
	Элементы.СтраницаКомментарий.Заголовок = " Комментарий" +?(ЗначениеЗаполнено(Объект.Комментарий)," (*)","");
	
КонецПроцедуры

&НаСервере
Функция ОпределитьПараваДоступа()
	
	ПравоРедактирования = CW_ПраваДоступа.ПравоДоступно("РедактированиеФинансов_ОперативныйУчет");
	Если НЕ ПравоРедактирования ИЛИ ЭтаФорма.ТолькоПросмотр Тогда
		ЭтаФорма.ТолькоПросмотр = Истина;
	КонецЕсли;
	
КонецФункции

&НаСервере
Функция СформироватьЗаголовокДокумента()
	
	ЭтаФорма.Заголовок = "Корректировка оперативной задолженности" + " " 
					+ ?(ЗначениеЗаполнено(Объект.ВидОперации), "("+Объект.ВидОперации+")", "")
					+ ?(ЗначениеЗаполнено(Объект.Ссылка), " "+Объект.Номер+" от "+Объект.Дата, " (создание)");
					
КонецФункции 
 
&НаСервере
Функция ОчиститьТабличныеЧастиДокумента()
	
	Объект.ДебиторскаяЗадолженность.Очистить();
	Объект.КредиторскаяЗадолженность.Очистить();

	ОбновитьИтогиНаФорме();
	
КонецФункции

&НаСервере
Функция ЗаполнитьДебиторскуюЗадолженностьНаСервере()
	
	Объект.ДебиторскаяЗадолженность.Очистить();
	
	ПараметрыПроцедуры = Новый Структура;
	ПараметрыПроцедуры.Вставить("Организация", 	Объект.Организация);
	ПараметрыПроцедуры.Вставить("Контрагент", 	Объект.Контрагент);
	ПараметрыПроцедуры.Вставить("Договор", 		Объект.Договор);
	//Подсистема.УчетПриложенийДоговоров
	ПараметрыПроцедуры.Вставить("ПриложениеКДоговору", Объект.ПриложениеКДоговору);
	//Подсистема.УчетПриложенийДоговоров 
	ПараметрыПроцедуры.Вставить("ВидЗадолженности", 	"ДЕБИТОРСКАЯ");
	
	Если Объект.Договор.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СПокупателем Тогда
		РезультатЗапроса = ДебиторскуюЗадолженностьОстатки(ПараметрыПроцедуры);
	Иначе
		РезультатЗапроса = КредиторскаяЗадолженностьОстатки(ПараметрыПроцедуры);
	КонецЕсли; 
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		НоваяСтрока =  Объект.ДебиторскаяЗадолженность.Добавить();
		
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		
		КурсПоСтроке = 1; КратностьПоСтроке = 1;
		Если Выборка.Валюта <> ВалютаРегламентированногоУчета Тогда
			
			КурсПоСтроке = ?(Выборка.СуммаВал = 0, 1, Окр(Выборка.Сумма / Выборка.СуммаВал, 4));
			
			ДатаКурса = Объект.Дата;
			Если ЗначениеЗаполнено(Выборка.ДокументСчет) тогда
				ДатаКурса = Выборка.ДокументДата;
			КонецЕсли;
			
			ДанныеКурса 		= CW_Финансы.ПолучитьКурсВалюты(Выборка.Валюта, ДатаКурса);  
			КратностьПоСтроке 	= ДанныеКурса.Кратность;  
			КурсПоСтроке		= Окр(КурсПоСтроке * КратностьПоСтроке, 4);
		КонецЕсли;
		
		НоваяСтрока.Курс 		= КурсПоСтроке;
		НоваяСтрока.Кратность 	= КратностьПоСтроке;
		
	КонецЦикла; 

	ОбновитьИтогиНаФорме();
	
КонецФункции

&НаСервере
Функция ЗаполнитьКредиторскуюЗадолженностьНаСервере()
	
	Объект.КредиторскаяЗадолженность.Очистить();
	
	ПараметрыПроцедуры = Новый Структура;
	ПараметрыПроцедуры.Вставить("Организация", 	Объект.Организация);
	ПараметрыПроцедуры.Вставить("Контрагент", 	Объект.КонтрагентКредитор);
	ПараметрыПроцедуры.Вставить("Договор", 		Объект.ДоговорКредитор);
	//Подсистема.УчетПриложенийДоговоров
	ПараметрыПроцедуры.Вставить("ПриложениеКДоговору", Объект.ПриложениеКДоговоруКредитор);
	//Подсистема.УчетПриложенийДоговоров
	ПараметрыПроцедуры.Вставить("ВидЗадолженности", 	"КРЕДИТОРСКАЯ");
	
	Если Объект.ДоговорКредитор.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СПокупателем Тогда
		РезультатЗапроса = ДебиторскуюЗадолженностьОстатки(ПараметрыПроцедуры);
	Иначе
		РезультатЗапроса = КредиторскаяЗадолженностьОстатки(ПараметрыПроцедуры);
	КонецЕсли; 

	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		НоваяСтрока =  Объект.КредиторскаяЗадолженность.Добавить();
		
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		
		КурсПоСтроке = 1; КратностьПоСтроке = 1;
		Если Выборка.Валюта <> ВалютаРегламентированногоУчета Тогда
			
			КурсПоСтроке = ?(Выборка.СуммаВал = 0, 1, Окр(Выборка.Сумма / Выборка.СуммаВал, 4));
			
			ДатаКурса = Объект.Дата;
			Если ЗначениеЗаполнено(Выборка.ДокументСчет) тогда
				ДатаКурса = Выборка.ДокументДата;
			КонецЕсли;
			
			ДанныеКурса 		= CW_Финансы.ПолучитьКурсВалюты(Выборка.Валюта, ДатаКурса);  
			КратностьПоСтроке 	= ДанныеКурса.Кратность;  
			КурсПоСтроке		= Окр(КурсПоСтроке * КратностьПоСтроке, 4);
		КонецЕсли;
		
		НоваяСтрока.Курс 		= КурсПоСтроке;
		НоваяСтрока.Кратность 	= КратностьПоСтроке;
		
	КонецЦикла; 
	
	ОбновитьИтогиНаФорме();
	
КонецФункции

&НаСервере
Функция ДебиторскуюЗадолженностьОстатки(ПараметрыПроцедуры)
	
	Запрос = Новый Запрос; 
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.Текст = "ВЫБРАТЬ
	|	CW_ОперативнаяДебиторскаяЗадолженностьОстатки.Счет КАК ДокументСчет,
	|	CW_ОперативнаяДебиторскаяЗадолженностьОстатки.Счет.Дата КАК ДокументДата,
	|	CW_ОперативнаяДебиторскаяЗадолженностьОстатки.Валюта КАК Валюта,
	|	CW_ОперативнаяДебиторскаяЗадолженностьОстатки.СчетУчета КАК СчетЗадолженности,
	|	CW_ОперативнаяДебиторскаяЗадолженностьОстатки.Всего_ВалютаОстаток КАК СуммаВал,
	|	CW_ОперативнаяДебиторскаяЗадолженностьОстатки.ВсегоОстаток КАК Сумма
	|ПОМЕСТИТЬ ДляОтбора
	|ИЗ
	|	РегистрНакопления.CW_ОперативнаяДебиторскаяЗадолженность.Остатки(
	|			&Период,
	|			Организация = &Организация
	|				И Контрагент = &Контрагент
	|				И Договор = &Договор
	|				И ПриложениеКДоговору = &ПриложениеКДоговору) КАК CW_ОперативнаяДебиторскаяЗадолженностьОстатки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.CW_ВидыОперативнойЗадолженности.Дебиторская) КАК ВидЗадолженности,
	|	ДляОтбора.ДокументСчет КАК ДокументСчет,
	|	ДляОтбора.ДокументДата КАК ДокументДата,
	|	ВЫБОР
	|		КОГДА ДляОтбора.ДокументСчет ССЫЛКА Документ.CW_КорректировкаОперативнойЗадолженности
	|			ТОГДА ПРЕДСТАВЛЕНИЕССЫЛКИ(ДляОтбора.ДокументСчет)
	|		ИНАЧЕ ДляОтбора.ДокументСчет.ПредставлениеДокумента
	|	КОНЕЦ КАК Представление,
	|	ДляОтбора.Валюта КАК Валюта,
	|	ДляОтбора.СчетЗадолженности КАК СчетЗадолженности,
	|	&Знак * ДляОтбора.СуммаВал КАК СуммаВал,
	|	&Знак * ДляОтбора.Сумма КАК Сумма
	|ИЗ
	|	ДляОтбора КАК ДляОтбора
	|ГДЕ
	|	//УслоивеОтбора 
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДляОтбора.ДокументДата";
	
	Если  ПараметрыПроцедуры.ВидЗадолженности = "КРЕДИТОРСКАЯ" Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "//УслоивеОтбора", "ДляОтбора.СуммаВал < 0");
		Запрос.УстановитьПараметр("Знак", -1); 
	ИначеЕсли  ПараметрыПроцедуры.ВидЗадолженности = "ДЕБИТОРСКАЯ" Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "//УслоивеОтбора", "ДляОтбора.СуммаВал > 0");
		Запрос.УстановитьПараметр("Знак", 1); 
	Иначе
		ВызватьИсключение "Ошибка заполнения табличной части!";
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Период", Новый Граница(Объект.Дата,ВидГраницы.Исключая)); 
	
	Для Каждого КлючЗначение из ПараметрыПроцедуры Цикл
		Запрос.УстановитьПараметр(КлючЗначение.Ключ, КлючЗначение.Значение);
	КонецЦикла;
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса;
	
КонецФункции

&НаСервере
Функция КредиторскаяЗадолженностьОстатки(ПараметрыПроцедуры)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.Текст = "ВЫБРАТЬ
	|	CW_ОперативнаяКредиторскаяЗадолженностьОстатки.Счет КАК ДокументСчет,
	|	CW_ОперативнаяКредиторскаяЗадолженностьОстатки.Счет.Дата КАК ДокументДата,
	|	CW_ОперативнаяКредиторскаяЗадолженностьОстатки.Валюта КАК Валюта,
	|	CW_ОперативнаяКредиторскаяЗадолженностьОстатки.СчетУчета КАК СчетЗадолженности,
	|	CW_ОперативнаяКредиторскаяЗадолженностьОстатки.Всего_ВалютаОстаток КАК СуммаВал,
	|	CW_ОперативнаяКредиторскаяЗадолженностьОстатки.ВсегоОстаток КАК Сумма
	|ПОМЕСТИТЬ ДляОтбора
	|ИЗ
	|	РегистрНакопления.CW_ОперативнаяКредиторскаяЗадолженность.Остатки(
	|			&Период,
	|			Организация = &Организация 
	|				И Контрагент = &Контрагент
	|				И Договор = &Договор
	|				И ПриложениеКДоговору = &ПриложениеКДоговору) КАК CW_ОперативнаяКредиторскаяЗадолженностьОстатки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДляОтбора.ДокументСчет КАК ДокументСчет,
	|	ДляОтбора.ДокументДата КАК ДокументДата,
	|	ДляОтбора.Валюта КАК Валюта,
	|	ДляОтбора.СчетЗадолженности КАК СчетЗадолженности,
	|	&Знак * ДляОтбора.СуммаВал КАК СуммаВал,
	|	&Знак * ДляОтбора.Сумма КАК Сумма,
	|	ЗНАЧЕНИЕ(Перечисление.CW_ВидыОперативнойЗадолженности.Кредиторская) КАК ВидЗадолженности,
	|	ВЫБОР
	|		КОГДА ДляОтбора.ДокументСчет ССЫЛКА Документ.CW_КорректировкаОперативнойЗадолженности
	|			ТОГДА ПРЕДСТАВЛЕНИЕССЫЛКИ(ДляОтбора.ДокументСчет)
	|		ИНАЧЕ ДляОтбора.ДокументСчет.ПредставлениеДокумента
	|	КОНЕЦ КАК Представление
	|ИЗ
	|	ДляОтбора КАК ДляОтбора
	|ГДЕ
	|	//УслоивеОтбора
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДляОтбора.ДокументДата";   
	
	Если  ПараметрыПроцедуры.ВидЗадолженности = "КРЕДИТОРСКАЯ" Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "//УслоивеОтбора", "ДляОтбора.СуммаВал > 0");
		Запрос.УстановитьПараметр("Знак", 1); 
	ИначеЕсли  ПараметрыПроцедуры.ВидЗадолженности = "ДЕБИТОРСКАЯ" Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "//УслоивеОтбора", "ДляОтбора.СуммаВал < 0");
		Запрос.УстановитьПараметр("Знак", -1); 
	Иначе
		ВызватьИсключение "Ошибка заполнения табличной части!";
	КонецЕсли;

	
	Запрос.УстановитьПараметр("Период", Новый Граница(Объект.Дата,ВидГраницы.Исключая)); 
	
	Для Каждого КлючЗначение из ПараметрыПроцедуры Цикл
		Запрос.УстановитьПараметр(КлючЗначение.Ключ, КлючЗначение.Значение);
	КонецЦикла;
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса;
	
КонецФункции
 
&НаСервере
Процедура ОбновитьИтогиНаФорме()
	
	//Дебиторска и кредиторская задолженность     
	Если (Объект.ДоговорКредитор.ВалютаДоговора = ВалютаРегламентированногоУчета и Объект.Договор.ВзаиморасчетыВУЕ) 
		или  (Объект.Договор.ВалютаДоговора = ВалютаРегламентированногоУчета и Объект.ДоговорКредитор.ВзаиморасчетыВУЕ) Тогда
		ЗачтеноКЗ 	 	= Объект.КредиторскаяЗадолженность.Итог("Сумма");  
		ВалютаЗачетаКЗ 	= ВалютаРегламентированногоУчета;

		ЗачтеноДЗ 		= Объект.ДебиторскаяЗадолженность.Итог("Сумма");   
		ВалютаЗачетаДЗ	= ВалютаРегламентированногоУчета

	Иначе
		ЗачтеноКЗ 		= Объект.КредиторскаяЗадолженность.Итог("СуммаВал");   
		ВалютаЗачетаКЗ 	= Объект.ДоговорКредитор.ВалютаДоговора;

		ЗачтеноДЗ 		= Объект.ДебиторскаяЗадолженность.Итог("СуммаВал");   
		ВалютаЗачетаДЗ 	= Объект.Договор.ВалютаДоговора;
	КонецЕсли;  
	
	Разница 	= ЗачтеноДЗ - ЗачтеноКЗ;  
	
	ИтогоКЗ 	= "Зачтено задолженности: "+Формат(ЗачтеноКЗ, "ЧЦ=15; ЧДЦ=2; ЧН=")+" "+Строка(ВалютаЗачетаКЗ);
	ИтогоДЗ 	= "Зачтено задолженности: "+Формат(ЗачтеноДЗ, "ЧЦ=15; ЧДЦ=2; ЧН=")+" "+Строка(ВалютаЗачетаДЗ);
	
	Если Разница <> 0 Тогда   
		ИтогоКЗ = ИтогоКЗ + "; Разница: "+Формат(Разница,"ЧЦ=15; ЧДЦ=2; ЧН=")+" "+Строка(ВалютаЗачетаКЗ);
		ИтогоДЗ = ИтогоДЗ + "; Разница: "+Формат(Разница,"ЧЦ=15; ЧДЦ=2; ЧН=")+" "+Строка(ВалютаЗачетаДЗ);
	КонецЕсли; 
	//--Дебиторска и кредиторская задолженность
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВопросаУстановкиНовогоНомера(Ответ, ДополнительныеПараметры) Экспорт 
	
	Если Ответ=КодВозвратаДиалога.Да Тогда
		УстановитьНовыйНомерНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция УстановитьНовыйНомерНаСервере()
	
	ТОбъект = РеквизитФормыВЗначение("Объект");
	ТОбъект.УстановитьНовыйНомер();
	ЗначениеВРеквизитФормы(ТОбъект,"Объект");
	
КонецФункции


#Область Подключаемые_внешние_команды

&НаКлиенте
Процедура ВнешняяКоманда_ВыполнитьКоманду(Команда)
	
	CW_ПодключаемыеКомандыКлиент.ВыполнитьВнешнююКоманду(ЭтотОбъект, Команда.Имя);
	
КонецПроцедуры

#КонецОбласти

//Подсистема.УчетПриложенийДоговоров
&НаСервере
Процедура УстановитьВидимостьПриложенийДоговоров()
	
	Элементы.ПриложениеКДоговору.Видимость 			= Объект.Договор.ИспользуютсяПриложения;
	Элементы.ПриложениеКДоговоруКредитор.Видимость 	= Объект.ДоговорКредитор.ИспользуютсяПриложения;
	
КонецПроцедуры
//Подсистема.УчетПриложенийДоговоров
